# NextSObj

## Description
Function NextSObj returns the next selected object in a list. If the end of the list is reached, the function returns NIL.

```pascal
FUNCTION NextSObj(h : HANDLE): HANDLE;
```

```python
def vs.NextSObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling